<META HTTP-EQUIV="Content-Type" CONTENT="text/html;charset=iso-8859-1">
<!DOCTYPE HTML PUBLIC "-//W3C//DTD W3 HTML//EN">
<HTML>
<HEAD>

<META content=text/html;charset=iso-8859-1 http-equiv=Content-Type><!DOCTYPE HTML PUBLIC "-//W3C//DTD W3 HTML//EN"><BASE 
href="file://D:\Programme\Gemeinsame Dateien\Microsoft Shared\Stationery\">
<STYLE>
<!--
body {
margin-left: 8em; 
font-family: arial;
font-size: 12pt;
color: 000000;
}
-->
</STYLE>

<META content='"MSHTML 4.72.2106.6"' name=GENERATOR>
</HEAD>
<BODY background=cid:004b01bde14f$d523ef90$0101a8c0@hp-xm bgColor=#ffffff>
<DIV>&nbsp;</DIV>
<DIV><FONT face=Arial size=2><B>-----Urspr&uuml;ngliche 
Nachricht-----</B><BR><B>Von: </B>Klaus Kuhl &lt;<A 
href="mailto:Kuhl.Klaus@T-Online.de">Kuhl.Klaus@T-Online.de</A>&gt;<BR><B>An: 
</B>Dolenga-GeoData-Shop &lt;<A 
href="mailto:Geo-Data_Dolenga@T-Online.de">Geo-Data_Dolenga@T-Online.de</A>&gt;<BR><B>Datum: 
</B>Montag, 14. September 1998 02:39<BR><B>Betreff: </B>Import von 
Vermessungsdaten mittels TKV<BR><BR></DIV></FONT>
<DIV>
<DIV>
<DIV>&nbsp;</DIV>
<DIV>Sehr geehrter Herr Dolenga, </DIV>
<DIV>&nbsp;</DIV>
<DIV>anbei sende ich Ihnen eine TKV-Datei von Vermessungdaten und drei 
ADF-Dateien, um den Datenimport einfacher zu gestalten.</DIV>
<OL>
    <LI>Ich gehe davon aus, da&szlig; Sie ein neues Projekt erstellt haben (der 
    Name sei hier TKV-Projekt) (vermeiden Sie Umlaute und Leerzeichen im 
    Projektnamen, da MegaCAD damit manchmal Probleme hat). 
    <LI>Erstellen Sie ein Verzeichnis, in dem die zu importierenden Dateien 
    gespeichert bleiben sollen. Nat&uuml;rlich k&ouml;nnen Sie die Daten auch 
    direkt von Diskette oder von &quot;irgendwo&quot; einlesen, aber der 
    &Uuml;bersichtlichkeit halber erstelle ich immer im jeweiligen Projekt ein 
    Verzeichnis <STRONG>Import</STRONG>. Also hier w&auml;re das<STRONG> 
    [Kanaldatenbank]\Projekte\TKV-Projekt\Import</STRONG>. Kopieren Sie die vier 
    Dateien in dieses Verzeichnis. 
    <LI>Starten Sie die Datenbank und &ouml;ffnen Sie das Projekt 
    <STRONG>TKV-Projekt</STRONG>. 
    <LI>Diese TKV Datei enth&auml;lt Ortslagen, Materialien und Profilarten, die 
    standardm&auml;&szlig;ig nicht im neuen Projekt enthalten sind. Diese 
    k&ouml;nnen Sie mit den ADF-Dateien einlesen. W&auml;hlen Sie dazu im 
    <STRONG>Men&uuml; &quot;Transfer|Import|Allgemeines Datenformat 
    (adf)&quot;</STRONG>. Klicken Sie auf das Symbol <IMG align=baseline alt="" 
    border=0 hspace=0 src="cid:004801bde14f$d51f5bb0$0101a8c0@hp-xm"> und 
    w&auml;hlen Sie die Datei <EM>Ortslagen.adf </EM>aus. Klicken Sie auf 
    <STRONG>Importieren</STRONG>. Es werden nun f&uuml;nf Ortslagen importiert. 
    Klicken Sie nun im Meldungsfenster auf <STRONG>Ende</STRONG> und im 
    Importdialog auf <STRONG>Beenden</STRONG>. 
    <LI>Sie k&ouml;nnten nat&uuml;rlich nun die weiteren Dateien einlesen. Aber, 
    um das Programm ein wenig kennen zu lernen w&auml;hlen Sie nun im Men&uuml; 
    <STRONG>&quot;Module|Importgruppe&quot;. </STRONG>Es &ouml;ffnet sich das 
    Fenster mit den Importgruppen. Hier ist nun eine neue Gruppe hinzugekommen, 
    und <STRONG>zwar ADF Import </STRONG>. Als Bezeichnung erschein dort das 
    Importdatum/Uhrzeit und die eingelesene Datei mit Pfad. Falls Sie nicht mehr 
    wissen, was alles mit dieser Datei importiert wurde klicken Sie nun mit der 
    rechten Maustaste auf die Importgruppe (Achtung: die Importgruppe mu&szlig; 
    markiert sein). W&auml;hlen Sie nun aus dem Kontextmen&uuml; den Eintrag 
    <STRONG>&quot;Daten|L&ouml;schen simulieren</STRONG>&quot;. Unter dem Punkt 
    Auswahllisten wird erw&auml;hnt, das diese Importgruppe 5 Ortslagen 
    beinhaltet. 
    <LI>&Ouml;ffnen Sie nun das Ortslagenfenster, in dem Sie im Men&uuml; 
    &quot;<STRONG>Module|Auswahltabellen|zur 
    Haltung|Ortslagenliste</STRONG>&quot; w&auml;hlen, oder in der linken 
    Knopfleiste den zweiten Knopf von oben dr&uuml;cken. Das Ortslagenfenster 
    enth&auml;lt nun die f&uuml;nf importierten Ortslagen. Beachten Sie in der 
    Spalte &quot;<STRONG>Importgruppe</STRONG>&quot; den Eintrag 
    <STRONG>&quot;ADF Import</STRONG>&quot;. Wenn Sie nun die Ortslagen wieder 
    los werden wollen, k&ouml;nnen Sie nun jede einzelne Ortslage einzeln 
    anklicken, dann auf &quot;L&ouml;schen&quot; klicken und dies 
    best&auml;tigen. Einfacher ist es jedoch, wenn Sie wieder in das Fenster 
    &quot;Importgruppen&quot; wechseln (klicken Sie hierzu auf den Knopf mit dem 
    Monitor in der oberen Knopfzeile, vierter von rechts, und Doppelklick auf 
    den Eintrag &quot;<STRONG>Importgruppe</STRONG>&quot;). Klicken Sie den 
    Eintrag <STRONG>&quot;ADF Import</STRONG>&quot; an und klicken Sie dann auf 
    L&ouml;schen (Knopf oben mit dem roten Kreuz). Best&auml;tigen Sie die 
    Sicherheitsabfragen. 
    <LI>Nun sind die Ortslagen auf einen Schlag wieder entfernt. Dies w&auml;re 
    in diesem Fall nat&uuml;rlich auch durch das f&uuml;nfmalige L&ouml;schen im 
    Ortslagenfenster m&ouml;glich, aber wenn nachher x Haltungen mit 
    Sch&auml;chten, Deckeln, Zu- und Abl&auml;ufen gel&ouml;scht werden sollen 
    erweisen sich die Importgruppen als sehr praktisch (es gibt auch noch 
    weitere Vorteile wie etwa das Selektieren aller Haltungen, die ein 
    bestimmter Vermesser aufgenommen hat). 
    <LI>Nun aber weiter zum TKV- Import: Importieren Sie nun die drei ADF 
    Dateien mit &quot;<STRONG>Transfer|Import|Allgemeines Datenformat 
    (adf)&quot; </STRONG><EM>Ortslagen.adf, Material.adf und Profilart.adf</EM>. 
    
    <LI>W&auml;hlen Sie nun &quot;<STRONG>Transfer|Import|Bestand|TKV&quot;. 
    </STRONG>W&auml;hlen Sie die Datei hs-bearbeitet.tkv. Es erschein rechts die 
    Versionsnummer 1.1 und der Marker unterst&uuml;tzt zeigt an, da&szlig; diese 
    Version von der Datenbank unterst&uuml;tzt wird. Achten Sie darauf, das der 
    Schalter &quot;nur pr&uuml;fen&quot; nicht eingeschlatet ist, da sonst nur 
    Pr&uuml;fungen und kein Import durchgef&uuml;hrt wird. Markieren Sie die 
    Schalter &quot;<STRONG>Zulaufdaten zur Haltung 
    &uuml;bernehmen</STRONG>&quot;, &quot;<STRONG>Stra&szlig;enschl&uuml;ssel 
    automatisch anlegen&quot;</STRONG> und &quot;<STRONG>Schl&uuml;ssel als 
    Namen &uuml;bernehmen</STRONG>&quot;. Klicken Sie nun auf Importieren. Es 
    erscheinen Warnungen bez&uuml;glich leerer Profilarten. Daf&uuml;r 
    m&uuml;&szlig;te man dem Vermesser eins auf die Finger hauen. Zwischendrin 
    zeigen Infos an, da&szlig; Stra&szlig;en automatisch angelegt werden. Nach 
    der Pr&uuml;fung erscheint unten eine Balkenanzeige, die anzeigt wie lange 
    der Import ungef&auml;hr noch dauern wird. 
    <LI>Klicken Sie nun im Meldungsfenster auf <STRONG>Ende</STRONG> und im 
    Importdialog auf <STRONG>Beenden</STRONG>. Versuchen Sie nun einmal in dem 
    Fenster Ortslagenliste eine Ortslage zu l&ouml;schen. Dies wird nun 
    verweigert, da ja Haltungen existieren, die auf diese Ortslagen verweisen. 
    <LI>W&auml;hlen Sie nun das Modul Bestand mit 
    <STRONG>&quot;Module|Bestand</STRONG>&quot; oder dr&uuml;cken Sie auf den 
    obersten Knopf in der Modulleiste. Es &ouml;ffnen sich nun das 
    Haltngsfenster und das Schachtfenster. Klicken Sie in beiden Fenstern die 
    rechte Maustaste, um das Kontextmen&uuml; zu &ouml;ffnen un w&auml;hlen Sie 
    dann den Men&uuml;punkt <STRONG>&quot;Ansicht|Zu/Abl&auml;ufe</STRONG>&quot; 
    bzw <STRONG>&quot;Ansicht|Deckel/Zu-Abl&auml;ufe etc </STRONG>&quot; um die 
    zweigeteilten Fenster komplett zu sehen. 
    <LI>Zum Erzeugen eines Bestandsplanes w&auml;hlen Sie 
    &quot;<STRONG>Pl&auml;ne|neu erzeugen</STRONG>&quot;. Zum Ansegen klicken 
    Sie auf den Knopf mit der Weltkugel, oder auf den Zoomen Knopf. 
    <LI>Falls beim Plan erzeugen bzw. beim Wechsel zu MegaCAD etwas nicht 
    funktioniert, kontrollieren Sie bitte die Einstellungen in 
    <STRONG>Optionen|GIS</STRONG>. 
    <LI>Das wars erst mal bis hierher. Viel Spa&szlig; beim Testen.</LI></OL>
<DIV>&nbsp;</DIV>
<DIV>&nbsp;</DIV>
<DIV>MfG</DIV>
<DIV>&nbsp;</DIV>
<DIV>Klaus Kuhl</DIV>
<DIV>&nbsp;</DIV>
<DIV><A href="mailto:Kuhl.Klaus@T-Online.de">Kuhl.Klaus@T-Online.de</A></DIV>
<DIV>&nbsp;</DIV>
<DIV>&nbsp;</DIV>
<DIV>P.S.: Zur Sicherheit habe ich die neueste Version der Kanaldatenbank 
Kanal3.zip, das Datadictionary (Datadict.zip) und das Planerzeugungsprogramm 
(Kanal_Zeichnen.zip) mit dabeigepackt.&nbsp;</DIV>
<DIV>Kanal3.zip enth&auml;lt Kanal3.exe und geh&ouml;rt ins 
Kanalhauptverzeichnis.</DIV>
<DIV>Datadict.zip enth&auml;lt Daten, die ins Unterverzeichnis 
Module\IngKaGis\Datadict\</DIV>
<DIV>KanalZeichnung.zip enth&auml;lt Kanal_Zeichnung.exe/ini und geh&ouml;rt ins 
Unterverzeichnis Module\Kanalzeichnung\.</DIV>
<DIV>Import.zip enth&auml;lt die oben beschriebenen Importdateien.</DIV>
<DIV>&nbsp;</DIV>
<DIV>
<HR>
</DIV>
<DIV>&nbsp;</DIV></DIV></DIV></BODY></HTML>
